nxp-mcuxpresso/mcux-soc-svd/MCXN527/MCXN527_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="PUF_CTRL">
      <name>PUF_CTRL_ALIAS1</name>
      <description>PUF Key Context Management</description>
      <alternatePeripheral>PUF_ALIAS1</alternatePeripheral>
      <groupName>PUF_CTRL</groupName>
      <baseAddress>0x4002D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PUF_CTRL">
      <name>PUF_CTRL_ALIAS2</name>
      <description>PUF Key Context Management</description>
      <alternatePeripheral>PUF_ALIAS2</alternatePeripheral>
      <groupName>PUF_CTRL</groupName>
      <baseAddress>0x4002E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="PUF_CTRL">
      <name>PUF_CTRL_ALIAS3</name>
      <description>PUF Key Context Management</description>
      <alternatePeripheral>PUF_ALIAS3</alternatePeripheral>
      <groupName>PUF_CTRL</groupName>
      <baseAddress>0x4002F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10C</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>BSP32_0</name>
      <description>CoolFlux BSP32</description>
      <groupName>BSP32</groupName>
      <baseAddress>0x40032000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x38</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BSP32</name>
        <value>133</value>
      </interrupt>
      <registers>
        <register>
          <name>offset_pmem</name>
          <description>Offset address register for program memory</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>Offset address register for program memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>offset_xmem</name>
          <description>Offset address register for X-data memory</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>Offset address register for X-data memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>offset_ymem</name>
          <description>Offset address register for Y-data memory</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>Offset address register for Y-data memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>offset_mailbox</name>
          <description>Offset address register for mailbox peripheral</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>Offset address register for mailbox peripheral</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>interrupts_external</name>
          <description>External interrupt register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>External interrupt register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>interrupts_status</name>
          <description>Interrupt status register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>val</name>
              <description>Interrupt status register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>cf_gating_override</name>
          <description>CoolFlux BSP32 gating override</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>CoolFlux BSP32 gating override</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ivt_offset</name>
          <description>CoolFlux BSP32 IVT offset register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>CoolFlux BSP32 IVT offset register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sleep_mode</name>
          <description>CoolFlux BSP32 sleep mode register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>CoolFlux BSP32 sleep mode register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ivt0</name>
          <description>CoolFlux BSP32 IVT register 0 content</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>CoolFlux BSP32 IVT register 0 content</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ivt1</name>
          <description>CoolFlux BSP32 IVT register 1 content</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x9</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>CoolFlux BSP32 IVT register 1 content</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ivt2</name>
          <description>CoolFlux BSP32 IVT register 2 content</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>CoolFlux BSP32 IVT register 2 content</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ivt3</name>
          <description>CoolFlux BSP32 IVT register 3 content</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>CoolFlux BSP32 IVT register 3 content</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ivt_disable</name>
          <description>CoolFlux BSP32 IVT disable register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>val</name>
              <description>CoolFlux BSP32 IVT disable register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
