nxp-mcuxpresso/mcux-soc-svd/MCXN527/MCXN527_cm33_core1.xml
        <register>
          <name>ICNS</name>
          <description>Interrupt Control Nonsecure</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NSE0</name>
              <description>Nonsecure Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSE1</name>
              <description>Nonsecure Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nse0</name>
                  <description>Secure access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nse1</name>
                  <description>Nonsecure access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNP</name>
          <description>Pin Control Nonprivilege</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NPE0</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE1</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE2</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE3</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE4</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE5</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE6</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE7</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE8</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE9</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE10</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE11</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE12</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE13</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE14</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE15</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE16</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE17</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE18</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE19</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE20</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE21</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE22</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE23</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE24</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE25</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE26</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE27</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE28</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPE29</name>
              <description>Nonprivilege Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>npe0</name>
                  <description>Privilege access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>npe1</name>
                  <description>Nonprivilege access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
